; функция - обновить параметры класса в таблице
(define (update characteristic deltas)
   (fold (lambda (out class d)
            (put out class (ff-fold (lambda (ff key value)
                                       (put ff key (+ value d)))
                           #empty (characteristic 0))))
      characteristic
      (iota 10 1) ; клас: (воин), напівельф, ельф, хоббіт, карлик, гном, напіворк, напівтроль, дунадан, високий ельф, кобольд
      deltas))

; сила, интеллект, мудрость, ловкость, телосложение, обаяние

(define СИЛА
   (update (pairs->ff `(
      (0 . ,(pairs->ff '( ; людина, стартові характеристики
               (0 . +5)  ; воїн
               (1 . -5)  ; маг
               (2 . -1)  ; священник
               (3 . +2)  ; крадій
               (4 . +2)  ; слідопит
               (5 . +3)  ; паладін
            )))))
   '(+0 -1 -2 -1 +2 +2 +4 +1 +1 -1)))

(define ІНТЕЛЕКТ ; ИНТЕЛЛЕКТ
   (update (pairs->ff `(
      (0 . ,(pairs->ff '( ; людина
               (0 . -2)  ; воїн
               (1 . +3)  ; маг
               (2 . -3)  ; священник
               (3 . +1)  ; крадій
               (4 . +2)  ; слідопит
               (5 . -3)  ; паладін
            )))))
   '(+1 +2 +2 +2 -3 -1 -4 +2 +3 -1)))

(define МУДРІСТЬ ; МУДРОСТЬ
   (update (pairs->ff `(
      (0 . ,(pairs->ff '( ; людина
               (0 . -2)  ; воїн
               (1 . +0)  ; маг
               (2 . +3)  ; священник
               (3 . -2)  ; крадій
               (4 . +0)  ; слідопит
               (5 . +1)  ; паладін
            )))))
   '(-1 -1 +1 +0 +2 +0 -2 +2 -1 +0)))

(define СПРИТНІСТЬ ; ЛОВКОСТЬ
   (update (pairs->ff `(
      (0 . ,(pairs->ff '( ; людина
               (0 . -2)  ; воїн
               (1 . +3)  ; маг
               (2 . -3)  ; священник
               (3 . +1)  ; крадій
               (4 . +2)  ; слідопит
               (5 . -3)  ; паладін
            )))))
   '(+1 +1 +3 +2 -2 +0 -4 +2 +3 +2)))

(define СТАТУРА ; ТЕЛОСЛОЖЕНИЕ
   (update (pairs->ff `(
      (0 . ,(pairs->ff '( ; людина
               (0 . -2)  ; воїн
               (1 . +3)  ; маг
               (2 . -3)  ; священник
               (3 . +1)  ; крадій
               (4 . +2)  ; слідопит
               (5 . -3)  ; паладін
            )))))
   '(-1 -2 +2 +1 +2 +1 +3 +3 +1 +2)))

(define ЧАРІВНІСТЬ ; ОБАЯНИЕ
   (update (pairs->ff `(
      (0 . ,(pairs->ff '( ; людина
               (0 . -2)  ; воїн
               (1 . +3)  ; маг
               (2 . -3)  ; священник
               (3 . +1)  ; крадій
               (4 . +2)  ; слідопит
               (5 . -3)  ; паладін
            )))))
   '(+1 +1 +1 -2 -3 -4 -6 +2 +5 -2)))

(define ЗДОРОВЬЕ
   (update (pairs->ff `(
      (0 . ,(pairs->ff '( ; людина
               (0 . 19)  ; воїн
               (1 . 10)  ; маг
               (2 . 12)  ; священник
               (3 . 16)  ; крадій
               (4 . 14)  ; слідопит
               (5 . 16)  ; паладін
            )))))
   '(+0 -1 -3 -2 +1 +0 +2 +0 +0 -2)))

(define ОПЫТ
   (update (pairs->ff `(
      (0 . ,(pairs->ff '( ; людина
               (0 . 100)  ; воїн
               (1 . 130)  ; маг
               (2 . 120)  ; священник
               (3 . 125)  ; крадій
               (4 . 130)  ; слідопит
               (5 . 135)  ; паладін
            )))))
   '(10 20 10 25 20 10 20 80 100 15)))

(define ИНФРАЗРЕНИЕ
   (update (pairs->ff `(
      (0 . ,(pairs->ff '( ; людина
               (0 . 0)  ; воїн
               (1 . 0)  ; маг
               (2 . 0)  ; священник
               (3 . 0)  ; крадій
               (4 . 0)  ; слідопит
               (5 . 0)  ; паладін
            )))))
   '(20 30 40 40 50 30 30 0 40 50)))
